- Importing required libraries

In [118]:
import pandas as pd
import matplotlib.pyplot as plt

- Reading data From CSV file

In [119]:
df = pd.read_csv("F:\PGDDS\PGD_Data_Science\csv_data\car_data.csv")

In [120]:
df.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

- Here we have out input data for that we removed column from our dataframe

In [121]:
X = df.drop("Selling_Price", axis= 1)

- Our input data is as below

In [122]:
X.head()

,Car_Name,Year,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,6.87,42450,Diesel,Dealer,Manual,0

- Our output data is as below

In [123]:
y = df.Selling_Price

In [124]:
y.head()

0    3.35
1    4.75
2    7.25
3    2.85
4    4.60
Name: Selling_Price, dtype: float64

- Information of our input dataframe

In [125]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 301 entries, 0 to 300
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Car_Name       301 non-null    object
 1   Year           301 non-null    int64
 2   Present_Price  301 non-null    float64
 3   Kms_Driven     301 non-null    int64
 4   Fuel_Type      301 non-null    object
 5   Seller_Type    301 non-null    object
 6   Transmission   301 non-null    object
 7   Owner          301 non-null    int64
dtypes: float64(1), int64(3), object(4)
memory usage: 18.9+ KB

In [126]:
X

,Car_Name,Year,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...
296,city,2016,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.90,5464,Petrol,Dealer,Manual,0

- For now we dont require column Car_Name and Present_Price, so we remove it from our dataframe

In [127]:
X.drop(['Car_Name', 'Present_Price'], axis = 1, inplace = True)

- Dataframe after removing above two columns

In [128]:
X.head()

   Year  Kms_Driven Fuel_Type Seller_Type Transmission  Owner
0  2014       27000    Petrol      Dealer       Manual      0
1  2013       43000    Diesel      Dealer       Manual      0
2  2017        6900    Petrol      Dealer       Manual      0
3  2011        5200    Petrol      Dealer       Manual      0
4  2014       42450    Diesel      Dealer       Manual      0

- We have to check if any null value is present or not

In [129]:
X.isnull().sum()

Year            0
Kms_Driven      0
Fuel_Type       0
Seller_Type     0
Transmission    0
Owner           0
dtype: int64

- Now We want our car model is how many years old so for that we perfome some operation on it by using present_year column

In [130]:
X['Present_Year'] = 2023

- Dataframe after adding Present_Year column

In [131]:
X.head()

   Year  Kms_Driven Fuel_Type Seller_Type Transmission  Owner  Present_Year
0  2014       27000    Petrol      Dealer       Manual      0          2023
1  2013       43000    Diesel      Dealer       Manual      0          2023
2  2017        6900    Petrol      Dealer       Manual      0          2023
3  2011        5200    Petrol      Dealer       Manual      0          2023
4  2014       42450    Diesel      Dealer       Manual      0          2023

- We want our car how many years old so for that we subtract year from present year

In [132]:
X['Year'] = X['Present_Year'] - X['Year']

- Here we get our car years

In [133]:
X.head()

   Year  Kms_Driven Fuel_Type Seller_Type Transmission  Owner  Present_Year
0     9       27000    Petrol      Dealer       Manual      0          2023
1    10       43000    Diesel      Dealer       Manual      0          2023
2     6        6900    Petrol      Dealer       Manual      0          2023
3    12        5200    Petrol      Dealer       Manual      0          2023
4     9       42450    Diesel      Dealer       Manual      0          2023

- Now we dont require column Present_year so we can remove it

In [134]:
X.drop("Present_Year", axis = 1, inplace = True)

In [135]:
X.head()

   Year  Kms_Driven Fuel_Type Seller_Type Transmission  Owner
0     9       27000    Petrol      Dealer       Manual      0
1    10       43000    Diesel      Dealer       Manual      0
2     6        6900    Petrol      Dealer       Manual      0
3    12        5200    Petrol      Dealer       Manual      0
4     9       42450    Diesel      Dealer       Manual      0

- Checking shape of our dataframe

In [136]:
X.shape

(301, 6)

-  Now we check unique value from columns Owner, Fuel_type, Transmission and seller_type

In [137]:
X['Owner'].unique()

array([0, 1, 3], dtype=int64)

In [138]:
X['Fuel_Type'].unique()

array(['Petrol', 'Diesel', 'CNG'], dtype=object)

In [139]:
X['Transmission'].unique()

array(['Manual', 'Automatic'], dtype=object)

In [140]:
X['Seller_Type'].unique()

array(['Dealer', 'Individual'], dtype=object)

# - Feature Engineering concept

In [141]:
X = pd.get_dummies(data = X, columns=['Fuel_Type','Transmission', 'Seller_Type'], drop_first=True)

In [142]:
X.head()

,Year,Kms_Driven,Owner,Fuel_Type_Diesel,Fuel_Type_Petrol,Transmission_Manual,Seller_Type_Individual
0,9,27000,0,0,1,1,0
1,10,43000,0,1,0,1,0
2,6,6900,0,0,1,1,0
3,12,5200,0,0,1,1,0
4,9,42450,0,1,0,1,0

In [143]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 301 entries, 0 to 300
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Year                    301 non-null    int64
 1   Kms_Driven              301 non-null    int64
 2   Owner                   301 non-null    int64
 3   Fuel_Type_Diesel        301 non-null    uint8
 4   Fuel_Type_Petrol        301 non-null    uint8
 5   Transmission_Manual     301 non-null    uint8
 6   Seller_Type_Individual  301 non-null    uint8
dtypes: int64(3), uint8(4)
memory usage: 8.4 KB

In [144]:
from sklearn.preprocessing import MinMaxScaler

In [145]:
scaler = MinMaxScaler()

In [146]:
X['Year'] = scaler.fit_transform(df[['Year']])

In [147]:
X.head()

,Year,Kms_Driven,Owner,Fuel_Type_Diesel,Fuel_Type_Petrol,Transmission_Manual,Seller_Type_Individual
0,0.733333,27000,0,0,1,1,0
1,0.666667,43000,0,1,0,1,0
2,0.933333,6900,0,0,1,1,0
3,0.533333,5200,0,0,1,1,0
4,0.733333,42450,0,1,0,1,0